Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.automation.gemini.note
source: Hooks must be installed with `cmux hooks gemini install`. They no-op outside cmux terminals.
ar: يجب تثبيت الخطافات باستخدام `cmux hooks gemini install`. وهي لا تؤدي أي وظيفة خارج طرفيات cmux.
de: Hooks müssen mit `cmux hooks gemini install` installiert werden. Sie haben außerhalb von cmux-Terminals keine Funktion (no-op).
es: Los ganchos se deben instalar con `cmux hooks gemini install`. No realizan ninguna operación fuera de las terminales de cmux.
fr: Les hooks doivent être installés avec `cmux hooks gemini install`. Ils n’ont aucun effet en dehors des terminaux cmux.
ja: フックは`cmux hooks gemini install`でインストールする必要があります。cmuxターミナル外では動作しません。
ko: `cmux hooks gemini install`로 훅을 설치해야 합니다. cmux 터미널 외부에서는 작동하지 않습니다.
zh_hans: 必须用 `cmux hooks gemini install` 安装钩子。它们在 cmux 终端之外不生效。
zh_hant: 必須透過 `cmux hooks gemini install` 安裝 Hook。它們在 cmux 終端機外不會執行任何操作。

# settings.automation.gemini.subtitleOff
source: Gemini runs without cmux integration.
ar: يعمل Gemini دون تكامل مع cmux.
de: Gemini läuft ohne cmux-Integration.
es: Gemini se ejecuta sin integración con cmux.
fr: Gemini s’exécute sans intégration cmux.
ja: GeminiはCmux連携なしで動作します。
ko: Gemini가 cmux 연동 없이 실행됩니다.
zh_hans: Gemini 在不集成 cmux 的情况下运行。
zh_hant: Gemini 執行時未與 cmux 整合。

# settings.automation.gemini.subtitleOn
source: Sidebar shows Gemini session status and notifications.
ar: يعرض الشريط الجانبي حالة جلسة Gemini وإشعاراتها.
de: Die Seitenleiste zeigt den Status der Gemini-Sitzung sowie Benachrichtigungen an.
es: La barra lateral muestra el estado de la sesión de Gemini y las notificaciones.
fr: La barre latérale affiche le statut de la session Gemini et ses notifications.
ja: サイドバーにGeminiセッションのステータスと通知が表示されます。
ko: 사이드바에 Gemini 세션 상태와 알림이 표시됩니다.
zh_hans: 侧边栏显示 Gemini 会话状态和通知。
zh_hant: 側邊欄會顯示 Gemini 工作階段狀態與通知。

# settings.automation.kiro
source: Kiro CLI Integration
ar: تكامل واجهة خط أوامر Kiro (CLI)
es: Integración de Kiro CLI
fr: Intégration Kiro CLI
ja: Kiro CLI連携
ko: Kiro CLI 연동
zh_hans: Kiro CLI 集成
zh_hant: Kiro CLI 整合

# settings.automation.kiro.note
source: Hooks must be installed with `cmux hooks kiro install`, then run Kiro with `kiro-cli chat --agent cmux` (or set it as your default agent). They no-op outside cmux terminals.
ar: يجب تثبيت الخطافات باستخدام `cmux hooks kiro install` ثم تشغيل Kiro عبر `kiro-cli chat --agent cmux` (أو تعيينه كعميلك الافتراضي). وهي لا تؤدي أي وظيفة خارج طرفيات cmux.
de: Hooks müssen mit `cmux hooks kiro install` installiert werden, führen Sie Kiro dann mit `kiro-cli chat --agent cmux` aus (oder legen Sie es als Standardagent fest). Sie haben außerhalb von cmux-Terminals keine Funktion (no-op).
es: Los ganchos se deben instalar con `cmux hooks kiro install`, luego ejecute Kiro con `kiro-cli chat --agent cmux` (o establézcalo como su agente predeterminado). No realizan ninguna operación fuera de las terminales de cmux.
fr: Les hooks doivent être installés avec `cmux hooks kiro install`, puis exécutez Kiro avec `kiro-cli chat --agent cmux` (ou définissez-le comme agent par défaut). Ils n’ont aucun effet en dehors des terminaux cmux.
ja: フックは`cmux hooks kiro install`でインストールし、Kiroを`kiro-cli chat --agent cmux`で起動（またはデフォルトエージェントに設定）してください。cmuxターミナル外では動作しません。
ko: `cmux hooks kiro install`로 훅을 설치한 다음 `kiro-cli chat --agent cmux`로 Kiro를 실행(또는 기본 에이전트로 설정)하세요. cmux 터미널 외부에서는 작동하지 않습니다.
zh_hans: 必须用 `cmux hooks kiro install` 安装钩子，然后用 `kiro-cli chat --agent cmux` 运行 Kiro（或将其设为默认代理）。它们在 cmux 终端之外不生效。
zh_hant: 必須透過 `cmux hooks kiro install` 安裝 Hook，然後使用 `kiro-cli chat --agent cmux` 執行 Kiro（或將其設定為您的預設代理程式）。它們在 cmux 終端機外不會執行任何操作。

# settings.automation.kiro.notificationLevel
source: Kiro Notification Level
ar: مستوى إشعارات Kiro
de: Kiro-Benachrichtigungsstufe
es: Nivel de notificación de Kiro
fr: Niveau de notification Kiro
ja: Kiro通知レベル
ko: Kiro 알림 수준
zh_hans: Kiro 通知级别
zh_hant: Kiro 通知層級

# settings.automation.kiro.notificationLevel.minimal
source: Minimal
ar: أدنى حد
es: Mínimo
ja: 最小
ko: 최소
zh_hans: 最少
zh_hant: 極簡

# settings.automation.kiro.notificationLevel.standard
source: Standard
ar: قياسي
es: Estándar
ja: 標準
ko: 표준
zh_hans: 标准
zh_hant: 標準

# settings.automation.kiro.notificationLevel.subtitle
source: Controls how many Kiro tool events appear in Feed.
ar: يتحكم في عدد أحداث أدوات Kiro التي تظهر في الموجز.
de: Steuert, wie viele Kiro-Werkzeugereignisse im Feed angezeigt werden.
es: Controla cuántos eventos de herramientas de Kiro aparecen en Feed.
fr: Contrôle le nombre d’événements d’outil Kiro qui apparaissent dans le Feed.
ja: Feedに表示するKiroツールイベントの量を制御します。
ko: Feed에 표시되는 Kiro 도구 이벤트 수를 제어합니다.
zh_hans: 控制有多少 Kiro 工具事件出现在 Feed 中。
zh_hant: 控制在 Feed 中顯示多少 Kiro 工具事件。

# settings.automation.kiro.notificationLevel.verbose
source: Verbose
ar: تفصيلي
de: Ausführlich
es: Detallado
fr: Détaillé
ja: 詳細
ko: 자세히
zh_hans: 详细
zh_hant: 詳細

# settings.automation.kiro.subtitleOff
source: Kiro runs without cmux integration.
ar: يعمل Kiro دون تكامل مع cmux.
de: Kiro läuft ohne cmux-Integration.
es: Kiro se ejecuta sin integración con cmux.
fr: Kiro s’exécute sans intégration cmux.
ja: Kiroはcmux連携なしで動作します。
ko: Kiro가 cmux 연동 없이 실행됩니다.
zh_hans: Kiro 在不集成 cmux 的情况下运行。
zh_hant: Kiro 執行時未與 cmux 整合。

# settings.automation.kiro.subtitleOn
source: Sidebar shows Kiro session status, notifications, and Feed tool events.
ar: يعرض الشريط الجانبي حالة جلسة Kiro وإشعاراتها وأحداث أدوات الموجز.
de: Die Seitenleiste zeigt den Status der Kiro-Sitzung, Benachrichtigungen und Kiro-Werkzeugereignisse im Feed an.
es: La barra lateral muestra el estado de la sesión de Kiro, las notificaciones y los eventos de herramientas de Feed.
fr: La barre latérale affiche le statut de la session Kiro, ses notifications et les événements d’outil du Feed.
ja: サイドバーにKiroセッションのステータス、通知、Feedツールイベントが表示されます。
ko: 사이드바에 Kiro 세션 상태, 알림, Feed 도구 이벤트가 표시됩니다.
zh_hans: 侧边栏显示 Kiro 会话状态、通知和 Feed 工具事件。
zh_hant: 側邊欄會顯示 Kiro 工作階段狀態、通知以及 Feed 工具事件。

# settings.automation.openAccess.dialog.cancel
source: Cancel
ar: إلغاء
bs: Otkaži
da: Annuller
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
nb: Avbryt
pl: Anuluj
pt_br: Cancelar
ru: Отменить
th: ยกเลิก
tr: Vazgeç
uk: Скасувати
zh_hans: 取消
zh_hant: 取消

# settings.automation.openAccess.dialog.confirm
source: Enable Full Open Access
ar: تفعيل الوصول المفتوح الكامل
bs: Omogući potpuni otvoreni pristup
da: Aktiver fuld åben adgang
de: Vollständigen offenen Zugriff aktivieren
es: Activar acceso abierto completo
fr: Activer l'accès ouvert complet
it: Abilita accesso aperto completo
ja: フルオープンアクセスを有効にする
ko: 전체 개방 접근 활성화
nb: Aktiver full åpen tilgang
pl: Włącz pełny otwarty dostęp
pt_br: Ativar Acesso Aberto Total
ru: Включить полный открытый доступ
th: เปิดใช้งานการเข้าถึงเปิดแบบเต็ม
tr: Tam Açık Erişimi Etkinleştir
uk: Увімкнути повний відкритий доступ
zh_hans: 启用完全开放访问
zh_hant: 啟用完全開放存取

# settings.automation.openAccess.dialog.message
source: This disables ancestry and password checks and opens the socket to all local users. Only enable when you understand the risk.
ar: يؤدي هذا إلى تعطيل فحوصات النسب وكلمة المرور ويفتح المقبس لجميع المستخدمين المحليين. قم بالتفعيل فقط عندما تفهم المخاطر.
bs: Ovo onemogućava provjere porijekla i lozinke i otvara utičnicu svim lokalnim korisnicima. Omogućite samo kada razumijete rizik.
da: Dette deaktiverer herkomst- og adgangskodekontrol og åbner socketen for alle lokale brugere. Aktiver kun, når du forstår risikoen.
de: Dies deaktiviert Abstammungs- und Passwortprüfungen und öffnet den Socket für alle lokalen Benutzer. Aktivieren Sie dies nur, wenn Sie das Risiko verstehen.
es: Esto desactiva las verificaciones de ascendencia y contraseña, y abre el socket a todos los usuarios locales. Activa solo si comprendes el riesgo.
fr: Cela désactive les vérifications de parenté et de mot de passe et ouvre le socket à tous les utilisateurs locaux. N'activez que si vous comprenez les risques.
it: Questa operazione disabilita i controlli di discendenza e password e apre il socket a tutti gli utenti locali. Abilita solo se comprendi il rischio.
ja: これにより、祖先プロセスチェックとパスワードチェックが無効になり、すべてのローカルユーザーにソケットが公開されます。リスクを理解した上で有効にしてください。
ko: 이 설정은 출처 확인 및 비밀번호 검사를 비활성화하고 모든 로컬 사용자에게 소켓을 개방합니다. 위험을 이해한 경우에만 활성화하세요.
nb: Dette deaktiverer opphavs- og passordkontroller og åpner socketen for alle lokale brukere. Aktiver bare når du forstår risikoen.
pl: To wyłącza sprawdzanie pochodzenia i hasła oraz otwiera gniazdo dla wszystkich lokalnych użytkowników. Włączaj tylko wtedy, gdy rozumiesz ryzyko.
pt_br: Isto desativa verificações de ancestralidade e senha e abre o socket para todos os usuários locais. Ative somente quando entender os riscos.
ru: Это отключает проверку происхождения и пароля и открывает сокет для всех локальных пользователей. Включайте только если понимаете риски.
th: การดำเนินการนี้จะปิดใช้งานการตรวจสอบสายสืบทอดและรหัสผ่าน และเปิดซ็อกเก็ตให้ผู้ใช้ในเครื่องทุกคน เปิดใช้งานเฉพาะเมื่อคุณเข้าใจความเสี่ยง
tr: Bu, soy ve parola denetimlerini devre dışı bırakır ve soketi tüm yerel kullanıcılara açar. Yalnızca riski anladığınızda etkinleştirin.
uk: Це вимикає перевірку походження та пароля і відкриває сокет для всіх локальних користувачів. Вмикайте лише якщо розумієте ризики.
zh_hans: 这将禁用祖先和密码检查，并向所有本地用户开放套接字。请确保您了解其中的风险后再启用。
zh_hant: 這將停用來源驗證和密碼檢查，並將 Socket 開放給所有本機使用者。請確認您了解風險後再啟用。

# settings.automation.openAccess.dialog.title
source: Enable full open access?
ar: تفعيل الوصول المفتوح الكامل؟
bs: Omogućiti potpuni otvoreni pristup?
da: Aktiver fuld åben adgang?
de: Vollständigen offenen Zugriff aktivieren?
es: ¿Activar acceso abierto completo?
fr: Activer l'accès ouvert complet ?
it: Abilitare l'accesso aperto completo?
ja: フルオープンアクセスを有効にしますか？
ko: 전체 개방 접근을 활성화하시겠습니까?
nb: Aktivere full åpen tilgang?
pl: Włączyć pełny otwarty dostęp?
pt_br: Ativar acesso aberto total?
ru: Включить полный открытый доступ?
th: เปิดใช้งานการเข้าถึงเปิดแบบเต็มหรือไม่?
tr: Tam açık erişim etkinleştirilsin mi?
uk: Увімкнути повний відкритий доступ?
zh_hans: 启用完全开放访问？
zh_hant: 要啟用完全開放存取嗎？

# settings.automation.openAccessWarning
source: Warning: Full open access makes the control socket world-readable/writable on this Mac and disables auth checks. Use only for local debugging.
ar: تحذير: الوصول المفتوح الكامل يجعل مقبس التحكم قابلاً للقراءة والكتابة من الجميع على هذا الـ Mac ويعطل فحوصات المصادقة. استخدم فقط لأغراض التصحيح المحلي.
bs: Upozorenje: Potpuni otvoreni pristup čini kontrolnu utičnicu čitljivom/zapisivom za sve na ovom Macu i onemogućava provjere autentikacije. Koristite samo za lokalno debugiranje.
da: Advarsel: Fuld åben adgang gør kontrolsocketen læsbar/skrivbar for alle på denne Mac og deaktiverer autentifikationskontrol. Brug kun til lokal fejlsøgning.
de: Warnung: Vollständiger offener Zugriff macht den Steuerungs-Socket auf diesem Mac für alle les- und schreibbar und deaktiviert Authentifizierungsprüfungen. Nur für lokales Debugging verwenden.
es: Advertencia: El acceso abierto completo hace que el socket de control sea legible/escribible para todos en este Mac y desactiva las verificaciones de autenticación. Usa solo para depuración local.
fr: Attention : l'accès ouvert complet rend le socket de contrôle lisible/inscriptible par tous sur ce Mac et désactive les vérifications d'authentification. À utiliser uniquement pour le débogage local.
it: Attenzione: l'accesso aperto completo rende il socket di controllo leggibile/scrivibile da tutti su questo Mac e disabilita i controlli di autenticazione. Usa solo per il debug locale.
ja: 警告: フルオープンアクセスにすると、このMac上の制御ソケットが誰でも読み書き可能になり、認証チェックが無効になります。ローカルデバッグ用途にのみ使用してください。
ko: 경고: 전체 개방 접근은 이 Mac에서 제어 소켓을 누구나 읽고 쓸 수 있게 하며 인증 검사를 비활성화합니다. 로컬 디버깅 전용으로만 사용하세요.
nb: Advarsel: Full åpen tilgang gjør kontrollsocketen lese-/skrivbar for alle på denne Mac-en og deaktiverer autentiseringskontroller. Bruk kun for lokal feilsøking.
pl: Ostrzeżenie: Pełny otwarty dostęp czyni gniazdo sterujące odczytywalnym/zapisywalnym dla wszystkich na tym Macu i wyłącza sprawdzanie uwierzytelniania. Używaj tylko do lokalnego debugowania.
pt_br: Aviso: O acesso aberto total torna o socket de controle legível/gravável por todos neste Mac e desativa verificações de autenticação. Use apenas para depuração local.
ru: Внимание: полный открытый доступ делает управляющий сокет доступным для чтения и записи всем пользователям на этом Mac и отключает проверку авторизации. Используйте только для локальной отладки.
th: คำเตือน: การเข้าถึงเปิดแบบเต็มทำให้ซ็อกเก็ตควบคุมอ่าน/เขียนได้จากทุกผู้ใช้บน Mac นี้และปิดใช้งานการตรวจสอบสิทธิ์ ใช้สำหรับการดีบักในเครื่องเท่านั้น
tr: Uyarı: Tam açık erişim, kontrol soketini bu Mac'te herkes tarafından okunabilir/yazılabilir yapar ve kimlik doğrulama denetimlerini devre dışı bırakır. Yalnızca yerel hata ayıklama için kullanın.
uk: Увага: повний відкритий доступ робить керуючий сокет доступним для читання/запису всім на цьому Mac та вимикає перевірки автентифікації. Використовуйте лише для локального налагодження.
zh_hans: 警告：完全开放访问将使控制套接字在此 Mac 上对所有用户可读/可写，并禁用身份验证检查。仅用于本地调试。
zh_hant: 警告：完全開放存取會讓控制 Socket 在此 Mac 上可被所有人讀寫，並停用驗證檢查。僅供本機除錯使用。

# settings.automation.port.note
source: Each workspace gets CMUX_PORT and CMUX_PORT_END env vars with a dedicated port range. New terminals inherit these values.
ar: تحصل كل مساحة عمل على متغيرات البيئة CMUX_PORT و CMUX_PORT_END مع نطاق منافذ مخصص. ترث الطرفيات الجديدة هذه القيم.
bs: Svaki radni prostor dobija CMUX_PORT i CMUX_PORT_END varijable okruženja sa dodijeljenim rasponom portova. Novi terminali nasljeđuju ove vrijednosti.
da: Hvert arbejdsområde får CMUX_PORT og CMUX_PORT_END miljøvariabler med et dedikeret portområde. Nye terminaler arver disse værdier.
de: Jeder Arbeitsbereich erhält CMUX_PORT- und CMUX_PORT_END-Umgebungsvariablen mit einem dedizierten Portbereich. Neue Terminals erben diese Werte.
es: Cada espacio de trabajo recibe las variables de entorno CMUX_PORT y CMUX_PORT_END con un rango de puertos dedicado. Los nuevos terminales heredan estos valores.
fr: Chaque espace de travail reçoit les variables d'environnement CMUX_PORT et CMUX_PORT_END avec une plage de ports dédiée. Les nouveaux terminaux héritent de ces valeurs.
it: Ogni area di lavoro riceve le variabili d'ambiente CMUX_PORT e CMUX_PORT_END con un intervallo di porte dedicato. I nuovi terminali ereditano questi valori.
ja: 各ワークスペースにはCMUX_PORTとCMUX_PORT_END環境変数で専用のポート範囲が割り当てられます。新しいターミナルはこれらの値を継承します。
ko: 각 작업 공간에 전용 포트 범위가 있는 CMUX_PORT 및 CMUX_PORT_END 환경 변수가 할당됩니다. 새 터미널은 이 값을 상속합니다.
nb: Hvert arbeidsområde får CMUX_PORT- og CMUX_PORT_END-miljøvariabler med et dedikert portområde. Nye terminaler arver disse verdiene.
pl: Każda przestrzeń robocza otrzymuje zmienne środowiskowe CMUX_PORT i CMUX_PORT_END z dedykowanym zakresem portów. Nowe terminale dziedziczą te wartości.
pt_br: Cada área de trabalho recebe as variáveis de ambiente CMUX_PORT e CMUX_PORT_END com uma faixa de portas dedicada. Novos terminais herdam esses valores.
ru: Каждое рабочее пространство получает переменные окружения CMUX_PORT и CMUX_PORT_END с выделенным диапазоном портов. Новые терминалы наследуют эти значения.
th: แต่ละเวิร์กสเปซจะได้รับตัวแปรสภาพแวดล้อม CMUX_PORT และ CMUX_PORT_END พร้อมช่วงพอร์ตเฉพาะ เทอร์มินัลใหม่จะสืบทอดค่าเหล่านี้
tr: Her çalışma alanı ayrılmış bir port aralığıyla CMUX_PORT ve CMUX_PORT_END ortam değişkenlerini alır. Yeni terminaller bu değerleri devralır.
uk: Кожна робоча область отримує змінні середовища CMUX_PORT та CMUX_PORT_END з виділеним діапазоном портів. Нові термінали успадковують ці значення.
zh_hans: 每个工作区会获得 CMUX_PORT 和 CMUX_PORT_END 环境变量，包含专用的端口范围。新终端会继承这些值。
zh_hant: 每個工作區都會取得包含專用連接埠範圍的 CMUX_PORT 和 CMUX_PORT_END 環境變數。新終端機會繼承這些值。

# settings.automation.portBase
source: Port Base
ar: المنفذ الأساسي
bs: Početni port
de: Port-Basis
es: Puerto base
fr: Port de base
it: Porta base
ja: ポートベース
ko: 포트 기준값
pl: Port bazowy
pt_br: Porta Base
ru: Базовый порт
th: พอร์ตเริ่มต้น
tr: Port Tabanı
uk: Базовий порт
zh_hans: 起始端口
zh_hant: 連接埠起始值

# settings.automation.portBase.subtitle
source: Starting port for CMUX_PORT env var.
ar: المنفذ الابتدائي لمتغير البيئة CMUX_PORT.
bs: Početni port za CMUX_PORT varijablu okruženja.
da: Startport for CMUX_PORT-miljøvariabel.
de: Startport für die CMUX_PORT-Umgebungsvariable.
es: Puerto inicial para la variable de entorno CMUX_PORT.
fr: Port de départ pour la variable d'environnement CMUX_PORT.
it: Porta iniziale per la variabile d'ambiente CMUX_PORT.
ja: CMUX_PORT環境変数の開始ポート。
ko: CMUX_PORT 환경 변수의 시작 포트.
nb: Startport for CMUX_PORT-miljøvariabelen.
pl: Port początkowy dla zmiennej środowiskowej CMUX_PORT.
pt_br: Porta inicial para a variável de ambiente CMUX_PORT.
ru: Начальный порт для переменной окружения CMUX_PORT.
th: พอร์ตเริ่มต้นสำหรับตัวแปรสภาพแวดล้อม CMUX_PORT
tr: CMUX_PORT ortam değişkeni için başlangıç portu.
uk: Початковий порт для змінної середовища CMUX_PORT.
zh_hans: CMUX_PORT 环境变量的起始端口。
zh_hant: CMUX_PORT 環境變數的起始連接埠。

# settings.automation.portRange
source: Port Range Size
ar: حجم نطاق المنافذ
bs: Veličina raspona portova
da: Portområdestørrelse
de: Portbereichsgröße
es: Tamaño del rango de puertos
fr: Taille de la plage de ports
it: Dimensione intervallo porte
ja: ポート範囲サイズ
ko: 포트 범위 크기
nb: Portområdestørrelse
pl: Rozmiar zakresu portów
pt_br: Tamanho da Faixa de Portas
ru: Размер диапазона портов
th: ขนาดช่วงพอร์ต
tr: Port Aralığı Boyutu
uk: Розмір діапазону портів
zh_hans: 端口范围大小
zh_hant: 連接埠範圍大小

# settings.automation.portRange.subtitle
source: Number of ports per workspace.
ar: عدد المنافذ لكل مساحة عمل.
bs: Broj portova po radnom prostoru.
da: Antal porte pr. arbejdsområde.
de: Anzahl der Ports pro Arbeitsbereich.
es: Número de puertos por espacio de trabajo.
fr: Nombre de ports par espace de travail.
it: Numero di porte per area di lavoro.
ja: ワークスペースあたりのポート数。
ko: 작업 공간당 포트 수.
nb: Antall porter per arbeidsområde.
pl: Liczba portów na przestrzeń roboczą.
pt_br: Número de portas por área de trabalho.
ru: Количество портов на рабочее пространство.
th: จำนวนพอร์ตต่อเวิร์กสเปซ
tr: Çalışma alanı başına port sayısı.
uk: Кількість портів на робочу область.
zh_hans: 每个工作区的端口数量。
zh_hant: 每個工作區的連接埠數量。

# settings.automation.ripgrep.customPath
source: Ripgrep Binary Path
ar: مسار ملف Ripgrep الثنائي
de: Ripgrep-Binärpfad
es: Ruta del binario Ripgrep
fr: Chemin du binaire Ripgrep
ja: Ripgrepバイナリパス
ko: Ripgrep 바이너리 경로
zh_hans: Ripgrep 二进制文件路径
zh_hant: Ripgrep 二進位檔路徑

# settings.automation.ripgrep.customPath.placeholder
source: e.g. /etc/profiles/per-user/you/bin/rg
ar: مثال: /etc/profiles/per-user/you/bin/rg
de: z. B. /etc/profiles/per-user/you/bin/rg
es: p. ej., /etc/profiles/per-user/you/bin/rg
fr: par ex. /etc/profiles/per-user/you/bin/rg
ja: 例: /etc/profiles/per-user/you/bin/rg
ko: 예: /etc/profiles/per-user/you/bin/rg
zh_hans: 例如 /etc/profiles/per-user/you/bin/rg
zh_hant: 例如：/etc/profiles/per-user/you/bin/rg

# settings.automation.ripgrep.customPath.subtitle
source: Custom path to the rg binary used by Find. Leave empty to use common install locations and PATH.
ar: مسار مخصص لملف rg الثنائي المستخدم بواسطة البحث (Find). اتركه فارغًا لاستخدام مواقع التثبيت الشائعة و PATH.
de: Benutzerdefinierter Pfad zur rg-Binärdatei, die von „Suchen“ verwendet wird. Leer lassen, um gängige Installationsorte und den PATH zu verwenden.
es: Ruta personalizada al binario rg utilizado por Buscar. Déjela vacía para usar las ubicaciones de instalación comunes y PATH.
fr: Chemin personnalisé vers le binaire rg utilisé par Find. Laisser vide pour utiliser les emplacements d’installation courants et le PATH.
ja: Findで使用するrgバイナリのカスタムパス。空欄の場合は一般的なインストール先とPATHを使用します。
ko: Find에서 사용하는 rg 바이너리의 사용자 지정 경로입니다. 일반 설치 위치와 PATH를 사용하려면 비워두세요.
zh_hans: 「查找」所用 rg 二进制文件的自定义路径。留空则使用常见安装位置和 PATH。
zh_hant: 「尋找」功能所使用的 rg 二進位檔自訂路徑。留空則會使用常見的安裝位置與 PATH。

# settings.automation.socketMode
source: Socket Control Mode
ar: وضع التحكم بالمقبس
bs: Režim kontrolne utičnice
da: Socket-kontroltilstand
de: Socket-Steuerungsmodus
es: Modo de control del socket
fr: Mode de contrôle du socket
it: Modalità controllo socket
ja: ソケット制御モード
ko: 소켓 제어 모드
nb: Socket-kontrollmodus
pl: Tryb sterowania gniazdem
pt_br: Modo de Controle do Socket
ru: Режим управления сокетом
th: โหมดควบคุมซ็อกเก็ต
tr: Soket Kontrol Modu
uk: Режим керуючого сокета
zh_hans: 套接字控制模式
zh_hant: Socket 控制模式

# settings.automation.socketMode.note
source: Controls access to the local Unix socket for programmatic control. Choose a mode that matches your threat model.
ar: يتحكم بالوصول إلى مقبس Unix المحلي للتحكم البرمجي. اختر الوضع الذي يتناسب مع نموذج التهديد الخاص بك.
bs: Kontroliše pristup lokalnoj Unix utičnici za programsku kontrolu. Odaberite režim koji odgovara vašem modelu prijetnji.
da: Styrer adgangen til den lokale Unix-socket til programmatisk kontrol. Vælg en tilstand, der passer til din trusselsmodel.
de: Steuert den Zugriff auf den lokalen Unix-Socket für programmatische Steuerung. Wählen Sie einen Modus, der Ihrem Bedrohungsmodell entspricht.
es: Controla el acceso al socket Unix local para control programático. Elige un modo que coincida con tu modelo de amenazas.
fr: Contrôle l'accès au socket Unix local pour le contrôle programmatique. Choisissez un mode adapté à votre modèle de menace.
it: Controlla l'accesso al socket Unix locale per il controllo programmatico. Scegli una modalità adeguata al tuo modello di rischio.
ja: プログラムによる制御のためのローカルUnix socketへのアクセスを制御します。脅威モデルに合ったモードを選択してください。
ko: 프로그래밍 방식 제어를 위한 로컬 Unix 소켓 접근을 제어합니다. 보안 모델에 맞는 모드를 선택하세요.
nb: Styrer tilgang til den lokale Unix-socketen for programmatisk kontroll. Velg en modus som passer til din trusselmodell.
pl: Kontroluje dostęp do lokalnego gniazda Unix do programowego sterowania. Wybierz tryb odpowiadający Twojemu modelowi zagrożeń.
pt_br: Controla o acesso ao socket Unix local para controle programático. Escolha um modo que corresponda ao seu modelo de ameaça.
ru: Управляет доступом к локальному Unix-сокету для программного управления. Выберите режим, соответствующий вашей модели угроз.
th: ควบคุมการเข้าถึงซ็อกเก็ต Unix ในเครื่องสำหรับการควบคุมแบบโปรแกรม เลือกโหมดที่ตรงกับรูปแบบภัยคุกคามของคุณ
tr: Programatik kontrol için yerel Unix soketine erişimi kontrol eder. Tehdit modelinize uyan bir mod seçin.
uk: Керує доступом до локального Unix-сокета для програмного контролю. Виберіть режим відповідно до вашої моделі загроз.
zh_hans: 控制本地 Unix 套接字的访问权限，用于程序化控制。请选择与您的安全需求匹配的模式。
zh_hant: 控制本機 Unix Socket 的程式化控制存取。選擇符合您安全需求的模式。
